/**
 * vs코드 유용한 단축키
 * 
 * 알트 + 좌우 = 편집했던 탭 이동
 * 알트 + 상하 = 선택한 라인 위아래 이동
 * 알트 + 쉬프트 + 상하 = 라인 위아래로 복사
 * 알트 + 컨트롤 + 상하 = 여러 줄 편집
 * 알트 + 컨트롤 + 좌우 = 탭 화면 좌우 분할
 * 
 * 컨트롤 + 쉬프트 + f = 파일 내용 검색 (이클립스 컨트롤 + h 같은것?)
 * 컨트롤 + e = 파일명 검색
 * 컨트롤 + 쉬프트 + e = 탐색기
 * 컨트롤 + w = 현재 편집 창 닫기
 * 컨트롤 + 쉬프트 + t = 이전에 닫은 창 다시 열기
 * 
 * 컨트롤 + \ = 화면 창 분할 (같은 파일 동시 편집,확인 가능)
 * 컨트롤 + 숫자 = 화면 분할 후 각 화면 포커싱 이동
 * 컨트롤 + j = 콘솔,터미널 창 여닫기
 * 컨트롤 + b = 좌측 메뉴 창 닫기
 * 컨트롤 + g = 라인 위치 찾아가기
 * 컨트롤 + x = 커서가 있는 한 라인만 잘라내기 or 선택된 부분 잘라내기(ㅇㅇ 그거)
 * 
 * 컨트롤 + / = 한줄 주석 (이클립스의 컨트롤 + 쉬프트 + c)
 * 컨트롤 + d = 특정 문자열 N 개 한번에 편집 (누를때마다 추가 선택)
 * 컨트롤 + 쉬프트 + L = 특정 문자열 전부 한번에 편집
 * 
 * 알트 + 좌클릭 = 클릭한 부분 동시 편집
 * 알트 + 쉬프트 + 드래그 = 블럭 동시 편집
 * 
 * F12 = 선택한 변수 정의문으로 이동
 * 알트 + F12 = 선택한 변수 정의문 간략히 보기
 * 컨트롤 + 좌클릭 = 선택한 변수 정의문 보기 (위에거 다 쓸모 없어 이게 짱)
 */

home1
home2
home3
home4
home5
home6
home7